prime5711/STM32F4_Example/Hello_led/Src/stm32f_shcho.c
/**
	******************************************************************************
  * @file    stm32446e_eval.c
  * @author  MCD Application Team
  * @version V1.1.0
  * @date    14-August-2015
  * @brief   This file provides a set of firmware functions to manage LEDs, 
  *          push-buttons and COM ports available on STM32446E-EVAL evaluation
  *          board(MB1045) RevB from STMicroelectronics.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2015 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */ 
  
/* File Info: ------------------------------------------------------------------
                                   User NOTE

   This driver requires the stm32446e_eval_io to manage the joystick

------------------------------------------------------------------------------*/

/* Includes ------------------------------------------------------------------*/
#include "stm32f_shcho.h"
#if defined(USE_IOEXPANDER)
#include "stm32446e_eval_io.h"
#endif /* USE_IOEXPANDER */


/** @addtogroup BSP
  * @{
  */ 

/** @addtogroup STM32446E_EVAL
  * @{
  */

/** @defgroup STM32446E_EVAL_LOW_LEVEL STM32446E-EVAL LOW LEVEL
  * @{
  */

//  /** @defgroup STM32446E_EVAL_LOW_LEVEL_Private_TypesDefinitions STM32446E Eval Low Level Private Typedef
//    * @{
//    */
//  typedef struct
//  {
//    __IO uint16_t REG;
//    __IO uint16_t RAM;
//  }LCD_CONTROLLER_TypeDef;
//  /**
//    * @}
//    */

//  /** @defgroup STM32446E_EVAL_LOW_LEVEL_Private_Defines STM32446E Eval Low Level Private Def
//    * @{
//    */
//  /**
//   * @brief STM32446E EVAL BSP Driver version number V1.1.0
//     */
//  #define __STM32446E_EVAL_BSP_VERSION_MAIN   (0x01) /*!< [31:24] main version */
//  #define __STM32446E_EVAL_BSP_VERSION_SUB1   (0x01) /*!< [23:16] sub1 version */
//  #define __STM32446E_EVAL_BSP_VERSION_SUB2   (0x00) /*!< [15:8]  sub2 version */
//  #define __STM32446E_EVAL_BSP_VERSION_RC     (0x00) /*!< [7:0]  release candidate */
//  #define __STM32446E_EVAL_BSP_VERSION         ((__STM32446E_EVAL_BSP_VERSION_MAIN << 24)\
//                                               |(__STM32446E_EVAL_BSP_VERSION_SUB1 << 16)\
//                                               |(__STM32446E_EVAL_BSP_VERSION_SUB2 << 8 )\
//                                               |(__STM32446E_EVAL_BSP_VERSION_RC))
//  											                                    
//  /* compared to F4xG we use BANK1 rather then BANK3 since we use FMC_NE1 signal (not FMC_NE3) */																				
//  #define FMC_BANK1_BASE  ((uint32_t)(0x60000000 | 0x00000000))  
//  #define FMC_BANK3_BASE  ((uint32_t)(0x60000000 | 0x08000000))  
//  #define FMC_BANK1       ((LCD_CONTROLLER_TypeDef *) FMC_BANK1_BASE)
//  
//  /**
//    * @}
//    */
//  
//  /** @defgroup STM32446E_EVAL_LOW_LEVEL_Private_Macros STM32446E Eval Low Level Private Macro
//    * @{
//    */
//  /**
//    * @}
//    */
//  
//  /** @defgroup STM32446E_EVAL_LOW_LEVEL_Private_Variables STM32446E Eval Low Level Variables 
//    * @{
//    */

//  #if defined(USE_IOEXPANDER)
const uint32_t GPIO_PIN[LEDn] = {LED1_PIN,
                                 LED2_PIN,
                                 LED3_PIN,
                                 LED4_PIN};
//  #else
//  const uint32_t GPIO_PIN[LEDn] = {LED1_PIN,
//  								     LED4_PIN };
//  #endif /* USE_IOEXPANDER */


//  GPIO_TypeDef* BUTTON_PORT[BUTTONn] = {WAKEUP_BUTTON_GPIO_PORT,
//                                        TAMPER_BUTTON_GPIO_PORT,
//                                        KEY_BUTTON_GPIO_PORT};
//  
//  const uint16_t BUTTON_PIN[BUTTONn] = {WAKEUP_BUTTON_PIN,
//                                        TAMPER_BUTTON_PIN,
//                                        KEY_BUTTON_PIN};
//  
//  const uint16_t BUTTON_IRQn[BUTTONn] = {WAKEUP_BUTTON_EXTI_IRQn,
//                                         TAMPER_BUTTON_EXTI_IRQn,
//                                         KEY_BUTTON_EXTI_IRQn};
//  
//  USART_TypeDef* COM_USART[COMn] = {EVAL_COM1};
//  
//  GPIO_TypeDef* COM_TX_PORT[COMn] = {EVAL_COM1_TX_GPIO_PORT};
//  
//  GPIO_TypeDef* COM_RX_PORT[COMn] = {EVAL_COM1_RX_GPIO_PORT};
//  
//  const uint16_t COM_TX_PIN[COMn] = {EVAL_COM1_TX_PIN};
//  
//  const uint16_t COM_RX_PIN[COMn] = {EVAL_COM1_RX_PIN};
//  
//  const uint16_t COM_TX_AF[COMn] = {EVAL_COM1_TX_AF};
//  
//  const uint16_t COM_RX_AF[COMn] = {EVAL_COM1_RX_AF};
//  
//  //  static FMPI2C_HandleTypeDef hEvalI2c;
//  
//  /**
//    * @}
//    */

//  /** @defgroup STM32446E_EVAL_LOW_LEVEL_Private_FunctionPrototypes STM32446E Eval Low Level Private Prototypes
//    * @{
//    */
//  static void     I2Cx_MspInit(void);
//  static void     I2Cx_Init(void);
//  #if defined(USE_IOEXPANDER)
//  static void     I2Cx_Write(uint8_t Addr, uint8_t Reg, uint8_t Value);
//  static uint8_t  I2Cx_Read(uint8_t Addr, uint8_t Reg);
//  #endif /* USE_IOEXPANDER */     
//  
//  static HAL_StatusTypeDef I2Cx_ReadMultiple(uint8_t Addr, uint16_t Reg, uint16_t MemAddSize, uint8_t *Buffer, uint16_t Length);
//  static HAL_StatusTypeDef I2Cx_WriteMultiple(uint8_t Addr, uint16_t Reg, uint16_t MemAddSize, uint8_t *Buffer, uint16_t Length);
//  static HAL_StatusTypeDef I2Cx_IsDeviceReady(uint16_t DevAddress, uint32_t Trials);
//  static void     I2Cx_Error(uint8_t Addr);
//  
//  static void     FMC_BANK1_WriteData(uint16_t Data);
//  static void     FMC_BANK1_WriteReg(uint8_t Reg);
//  static uint16_t FMC_BANK1_ReadData(void);
//  static void     FMC_BANK1_Init(void);
//  static void     FMC_BANK1_MspInit(void);
//  
//  /* IOExpander IO functions */
//  #if defined(USE_IOEXPANDER)
//  void            MFX_IO_Init(void);
//  void            MFX_IO_DeInit(void);
//  void            MFX_IO_ITConfig(void);
//  void            MFX_IO_Delay(uint32_t Delay);
//  void            MFX_IO_Write(uint16_t Addr, uint8_t Reg, uint8_t Value);
//  uint8_t         MFX_IO_Read(uint16_t Addr, uint8_t Reg);
//  uint16_t        MFX_IO_ReadMultiple(uint16_t Addr, uint8_t Reg, uint8_t *Buffer, uint16_t Length);
//  void            MFX_IO_Wakeup(void);
//  void            MFX_IO_EnableWakeupPin(void);
//  #endif /* USE_IOEXPANDER */
//  
//  /* LCD IO functions */
//  void            LCD_IO_Init(void);
//  void            LCD_IO_WriteData(uint16_t RegValue);
//  void            LCD_IO_WriteReg(uint8_t Reg);
//  uint16_t        LCD_IO_ReadData(void);
//  
//  /* AUDIO IO functions */
//  void            AUDIO_IO_Init(void);
//  void            AUDIO_IO_DeInit(void);
//  void            AUDIO_IO_Write(uint8_t Addr, uint16_t Reg, uint16_t Value);
//  uint16_t        AUDIO_IO_Read(uint8_t Addr, uint16_t Reg);
//  void            AUDIO_IO_Delay(uint32_t Delay);
//  
//  /* CAMERA IO functions */
//  void            CAMERA_IO_Init(void);
//  void            CAMERA_Delay(uint32_t Delay);
//  void            CAMERA_IO_Write(uint8_t Addr, uint16_t Reg, uint16_t Value);
//  uint16_t        CAMERA_IO_Read(uint8_t Addr, uint16_t Reg);
//  
//  /* I2C EEPROM IO function */
//  void                EEPROM_IO_Init(void);
//  HAL_StatusTypeDef   EEPROM_IO_WriteData(uint16_t DevAddress, uint16_t MemAddress, uint8_t* pBuffer, uint32_t BufferSize);
//  HAL_StatusTypeDef   EEPROM_IO_ReadData(uint16_t DevAddress, uint16_t MemAddress, uint8_t* pBuffer, uint32_t BufferSize);
//  HAL_StatusTypeDef   EEPROM_IO_IsDeviceReady(uint16_t DevAddress, uint32_t Trials);
//  
//  
//  /**
//    * @}
//    */
    


//  /** @defgroup STM32446E_EVAL_LOW_LEVEL_Private_Functions STM32446E Eval Low Level Private Functions
//    * @{
//    */ 
//  
//    /**
//    * @brief  This method returns the STM32446E EVAL BSP Driver revision
//    * @param  None
//    * @retval version: 0xXYZR (8bits for each decimal, R for RC)
//    */
//  uint32_t BSP_GetVersion(void)
//  {
//    return __STM32446E_EVAL_BSP_VERSION;
//  }
//  
//  /**
//    * @brief  Configures LEDs.
//    * @param  Led: LED to be configured. 
//    *          This parameter can be one of the following values:
//    *            @arg  LED1
//    *            @arg  LED2
//    *            @arg  LED3
//    *            @arg  LED4
//    * @retval None
//    */
void BSP_LED_Init(Led_TypeDef Led)
{
#if !defined(USE_STM32446E_EVAL_REVA)
  GPIO_InitTypeDef  gpio_init_structure;

  /* On RevB led1 and Led3 are on GPIO while Led2 and Led4 on Mfx*/
//    if ((Led == LED1) || (Led == LED3))
  if ((Led == LED1) || (Led == LED3) || (Led == LED2) || (Led == LED4))
  {
    /* Enable the GPIO_LED clock */
    LEDx_GPIO_CLK_ENABLE();

    /* Configure the GPIO_LED pin */
    gpio_init_structure.Pin = GPIO_PIN[Led];
    gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
    gpio_init_structure.Pull = GPIO_PULLUP;
    gpio_init_structure.Speed = GPIO_SPEED_HIGH;
  
    HAL_GPIO_Init(LEDx_GPIO_PORT, &gpio_init_structure);
    
