prime5711/STM32F4_Example/Hello_led/Src/stm32f_shcho.c
//    hsram.Init.WriteFifo          = FMC_WRITE_FIFO_DISABLE;
//    hsram.Init.PageSize           = FMC_PAGE_SIZE_NONE;
//  
//    /* Initialize the SRAM controller */
//    FMC_BANK1_MspInit();
//    HAL_SRAM_Init(&hsram, &sram_timing, &sram_timing);   
//  }
//  
//  
//  /**
//    * @brief  Writes register value.
//    * @param  Data: Data to be written 
//    * @retval None
//    */
//  static void FMC_BANK1_WriteData(uint16_t Data) 
//  {
//    /* Write 16-bit Reg */
//    FMC_BANK1->RAM = Data;
//  }
//  
//  /**
//    * @brief  Writes register address.
//    * @param  Reg: Register to be written
//    * @retval None
//    */
//  static void FMC_BANK1_WriteReg(uint8_t Reg) 
//  {
//    /* Write 16-bit Index, then write register */
//    FMC_BANK1->REG = Reg;
//  }
//  
//  /**
//    * @brief  Reads register value.
//    * @param  None
//    * @retval Read value
//    */
//  static uint16_t FMC_BANK1_ReadData(void) 
//  {
//    return FMC_BANK1->RAM;
//  }
//  
//  /*******************************************************************************
//                              LINK OPERATIONS
//  *******************************************************************************/
//  
//  #if defined(USE_IOEXPANDER)
//  
//  /********************************* LINK MFX ***********************************/
//  
//  /**
//    * @brief  Initializes MFX low level.
//    * @param  None
//    * @retval None
//    */
//  void MFX_IO_Init(void)
//  {
//    I2Cx_Init();
//  }
//  
//  /**
//    * @brief  DeInitializes MFX low level.
//    * @param  None
//    * @retval None
//    */
//  void MFX_IO_DeInit(void)
//  {
//  }
//  
//  /**
//    * @brief  Configures MFX low level interrupt.
//    * @param  None
//    * @retval None
//    */
//  void MFX_IO_ITConfig(void)
//  {
//    GPIO_InitTypeDef  gpio_init_structure;
//  
//    /* Enable the GPIO EXTI clock */
//    __HAL_RCC_GPIOA_CLK_ENABLE();
//    __HAL_RCC_SYSCFG_CLK_ENABLE();
//  
//    /* PA0 is the MFX_OUT_IRQ (often used for EXTI_WKUP) */    
//    gpio_init_structure.Pin   = GPIO_PIN_0;
//    gpio_init_structure.Pull  = GPIO_NOPULL;
//    gpio_init_structure.Speed = GPIO_SPEED_LOW;
//    gpio_init_structure.Mode  = GPIO_MODE_IT_RISING;
//    HAL_GPIO_Init(GPIOA, &gpio_init_structure);
//  
//    /* Enable and set GPIO EXTI Interrupt to the lowest priority */
//    HAL_NVIC_SetPriority((IRQn_Type)(EXTI0_IRQn), 0x0F, 0x0F);
//    HAL_NVIC_EnableIRQ((IRQn_Type)(EXTI0_IRQn));
//  }
//  
//  /**
//    * @brief  MFX writes single data.
//    * @param  Addr: I2C address
//    * @param  Reg: Register address 
//    * @param  Value: Data to be written
//    * @retval None
//    */
//  void MFX_IO_Write(uint16_t Addr, uint8_t Reg, uint8_t Value)
//  {
//    I2Cx_Write((uint8_t) Addr, Reg, Value);
//  }
//  
//  /**
//    * @brief  MFX reads single data.
//    * @param  Addr: I2C address
//    * @param  Reg: Register address 
//    * @retval Read data
//    */
//  uint8_t MFX_IO_Read(uint16_t Addr, uint8_t Reg)
//  {
//    return I2Cx_Read((uint8_t) Addr, Reg);
//  }
//  
//  /**
//    * @brief  MFX reads multiple data.
//    * @param  Addr: I2C address
//    * @param  Reg: Register address 
//    * @param  Buffer: Pointer to data buffer
//    * @param  Length: Length of the data
//    * @retval Number of read data
//    */
//  uint16_t MFX_IO_ReadMultiple(uint16_t Addr, uint8_t Reg, uint8_t *Buffer, uint16_t Length)
//  {
//   return I2Cx_ReadMultiple((uint8_t) Addr, (uint16_t)Reg, FMPI2C_MEMADD_SIZE_8BIT, Buffer, Length);
//  }
//  
//  /**
//    * @brief  MFX delay 
//    * @param  Delay: Delay in ms
//    * @retval None
//    */
//  void MFX_IO_Delay(uint32_t Delay)
//  {
//    HAL_Delay(Delay);
//  }
//  
//  /**
//    * @brief  Used by Lx family but requested for MFX component compatibility.
//    * @param  None
//    * @retval None
//    */
//  void MFX_IO_Wakeup(void) 
//  {
//  }
//  
//  /**
//    * @brief  Used by Lx family but requested for MXF component compatibility.
//    * @param  None
//    * @retval None
//    */
//  void MFX_IO_EnableWakeupPin(void) 
//  {
//  }
//  
//  #endif /* USE_IOEXPANDER */
//  
//  /********************************* LINK LCD ***********************************/
//  
//  /**
//    * @brief  Initializes LCD low level.
//    * @param  None
//    * @retval None
//    */
//  void LCD_IO_Init(void) 
//  {
//      FMC_BANK1_Init();
//  }
//  
//  /**
//    * @brief  Writes data on LCD data register.
//    * @param  Data: Data to be written
//    * @retval None
//    */
//  void LCD_IO_WriteData(uint16_t RegValue) 
//  {
//    /* Write 16-bit Reg */
//    FMC_BANK1_WriteData(RegValue);
//  }
//  
//  /**
//    * @brief  Writes register on LCD register.
//    * @param  Reg: Register to be written
//    * @retval None
//    */
//  void LCD_IO_WriteReg(uint8_t Reg) 
//  {
//    /* Write 16-bit Index, then Write Reg */
//    FMC_BANK1_WriteReg(Reg);
//  }
//  
//  /**
//    * @brief  Reads data from LCD data register.
//    * @param  None
//    * @retval Read data.
//    */
//  uint16_t LCD_IO_ReadData(void) 
//  {
//    return FMC_BANK1_ReadData();
//  }
//  
//  /********************************* LINK AUDIO *********************************/
//  
//  /**
//    * @brief  Initializes Audio low level.
//    * @param  None
//    * @retval None
//    */
//  void AUDIO_IO_Init(void) 
//  {
//    I2Cx_Init();
//  }
//  
//  /**
//    * @brief  DeInitializes Audio low level.
//    */
//  void AUDIO_IO_DeInit(void)
//  {
//  
//  }
//  
//  /**
//    * @brief  Writes a single data.
//    * @param  Addr: I2C address
//    * @param  Reg: Reg address 
//    * @param  Value: Data to be written
//    * @retval None
//    */
//  void AUDIO_IO_Write(uint8_t Addr, uint16_t Reg, uint16_t Value)
//  {
//    uint16_t tmp = Value;
//    
//    Value = ((uint16_t)(tmp >> 8) & 0x00FF);
//    
//    Value |= ((uint16_t)(tmp << 8)& 0xFF00);
//    
//    I2Cx_WriteMultiple(Addr, Reg, FMPI2C_MEMADD_SIZE_16BIT,(uint8_t*)&Value, 2);
//  }
//  
//  /**
//    * @brief  Reads a single data.
//    * @param  Addr: I2C address
//    * @param  Reg: Reg address 
//    * @retval Data to be read
//    */
//  uint16_t AUDIO_IO_Read(uint8_t Addr, uint16_t Reg)
//  {
//    uint16_t read_value = 0, tmp = 0;
//    
//    I2Cx_ReadMultiple(Addr, Reg, FMPI2C_MEMADD_SIZE_16BIT, (uint8_t*)&read_value, 2); 
//    
//    tmp = ((uint16_t)(read_value >> 8) & 0x00FF);
//    
//    tmp |= ((uint16_t)(read_value << 8)& 0xFF00);
//    
//    read_value = tmp;
//    
//    return read_value;
//  }
//  
//  /**
//    * @brief  AUDIO Codec delay 
//    * @param  Delay: Delay in ms
//    * @retval None
//    */
//  void AUDIO_IO_Delay(uint32_t Delay)
//  {
//    HAL_Delay(Delay);
//  }
//  
//  /********************************* LINK CAMERA ********************************/
//  
//  /**
//    * @brief  Initializes Camera low level.
//    * @param  None
//    * @retval None
//    */
//  void CAMERA_IO_Init(void) 
//  {
//    I2Cx_Init();
//  }
//  
//  /**
//    * @brief  Camera writes single data.
//    * @param  Addr: I2C address
//    * @param  Reg: Register address 
//    * @param  Value: Data to be written
//    * @retval None
//    */
//  void CAMERA_IO_Write(uint8_t Addr, uint16_t Reg, uint16_t Value)
//  {
//    uint16_t tmp = Value;
//    /* For S5K5CAG sensor, 16 bits accesses are used */
//    Value = ((uint16_t)(tmp >> 8) & 0x00FF);
//    Value |= ((uint16_t)(tmp << 8)& 0xFF00);
//    I2Cx_WriteMultiple(Addr, Reg, FMPI2C_MEMADD_SIZE_16BIT,(uint8_t*)&Value, 2);
//  }
//  
//  /**
//    * @brief  Camera reads single data.
//    * @param  Addr: I2C address
//    * @param  Reg: Register address 
//    * @retval Read data
//    */
//  uint16_t CAMERA_IO_Read(uint8_t Addr, uint16_t Reg)
//  {
//    uint16_t read_value = 0, tmp = 0;
//    /* For S5K5CAG sensor, 16 bits accesses are used */
//    I2Cx_ReadMultiple(Addr, Reg, FMPI2C_MEMADD_SIZE_16BIT, (uint8_t*)&read_value, 2);
//    tmp = ((uint16_t)(read_value >> 8) & 0x00FF);
//    tmp |= ((uint16_t)(read_value << 8)& 0xFF00);
//    read_value = tmp;
//    return read_value;
//  }
//  
//  /**
//    * @brief  Camera delay 
//    * @param  Delay: Delay in ms
//    * @retval None
//    */
//  void CAMERA_Delay(uint32_t Delay)
//  {
//    HAL_Delay(Delay);
//  }
//  
//  /******************************** LINK I2C EEPROM *****************************/
//  
//  /**
//    * @brief  Initializes peripherals used by the I2C EEPROM driver.
//    * @param  None
//    * @retval None
//    */
//  void EEPROM_IO_Init(void)
//  {
//    I2Cx_Init();
//  }
//  
//  /**
//    * @brief  Write data to I2C EEPROM driver in using DMA channel.
//    * @param  DevAddress: Target device address
//    * @param  MemAddress: Internal memory address
//    * @param  pBuffer: Pointer to data buffer
//    * @param  BufferSize: Amount of data to be sent
//    * @retval HAL status
//    */
//  HAL_StatusTypeDef EEPROM_IO_WriteData(uint16_t DevAddress, uint16_t MemAddress, uint8_t* pBuffer, uint32_t BufferSize)
//  {
//    return (I2Cx_WriteMultiple(DevAddress, MemAddress, FMPI2C_MEMADD_SIZE_16BIT, pBuffer, BufferSize));
//  }
//  
//  /**
//    * @brief  Read data from I2C EEPROM driver in using DMA channel.
//    * @param  DevAddress: Target device address
//    * @param  MemAddress: Internal memory address
//    * @param  pBuffer: Pointer to data buffer
//    * @param  BufferSize: Amount of data to be read
//    * @retval HAL status
//    */
//  HAL_StatusTypeDef EEPROM_IO_ReadData(uint16_t DevAddress, uint16_t MemAddress, uint8_t* pBuffer, uint32_t BufferSize)
//  {
//    return (I2Cx_ReadMultiple(DevAddress, MemAddress, FMPI2C_MEMADD_SIZE_16BIT, pBuffer, BufferSize));
//  }
//  
//  /**
//    * @brief  Checks if target device is ready for communication. 
//    * @note   This function is used with Memory devices
//    * @param  DevAddress: Target device address
//    * @param  Trials: Number of trials
//    * @retval HAL status
//    */
//  HAL_StatusTypeDef EEPROM_IO_IsDeviceReady(uint16_t DevAddress, uint32_t Trials)
//  { 
//    return (I2Cx_IsDeviceReady(DevAddress, Trials));
//  }
//  
//  
//  
//  /**
//    * @}
//    */
//  
//  /**
//    * @}
//    */ 
//  
//  /**
//    * @}
//    */
//  
//  /**
//    * @}
//    */    
//      
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
